Revit 2027 API
BuiltInFailures.DimensionFailures.CannotToggleDimensionEquality Property
 Toggling the dimension's equality constraint would overconstrain the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotToggleDimensionEquality { get; }
Public Shared ReadOnly Property CannotToggleDimensionEquality As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotToggleDimensionEquality {
	FailureDefinitionId^ get ();
}
static member CannotToggleDimensionEquality : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace